tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "eugene-babichenko/fixit"
tap "felixkratz/formulae", trusted: true
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Smart session manager for the terminal
brew "sesh"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Simple hotkey-daemon for macOS.
brew "asmvik/formulae/skhd", trusted: true
# A utility to fix mistakes in your commands.
brew "eugene-babichenko/fixit/fixit", trusted: true
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
cask "font-meslo-lg-nerd-font"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Screenshot and annotation tool
cask "ksnip"
# Clipboard manager
cask "maccy"
# Utility to extend trackpad functionality
cask "middleclick"
# System monitor for the menu bar
cask "stats"
vscode "bourhaouta.tailwindshades"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "daviddai.deepseek-code-generator"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "github.codespaces"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hjb2012.vscode-es6-string-html"
vscode "icrawl.discord-vscode"
vscode "james-yu.latex-workshop"
vscode "jumpinjackie.vscode-map-preview"
vscode "mathematic.vscode-latex"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.remote-explorer"
vscode "randomfractalsinc.geo-data-viewer"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "sidthesloth.html5-boilerplate"
vscode "tecosaur.latex-utilities"
vscode "tomoki1207.pdf"
vscode "vscjava.vscode-gradle"
vscode "wscats.cors-browser"
vscode "zarifprogrammer.tailwind-snippets"
