jorgebucaran/fisher
patrickf1/fzf.fish
rstacruz/fish-npm-global
jorgebucaran/nvm.fish
edc/bass
oh-my-fish/oh-my-fish
jethrokuan/z
ilancosman/tide@v6
rose-pine/tide
